class10/ShirtsApp3/in_class_solution/app/controllers/shirts_controller.rb

SELECT "shirts".* FROM "shirts"
---
  def index
    @shirts = Shirt.all

SELECT "shirts".* FROM "shirts" WHERE (name LIKE 'brown')
---
  def search
    @query = params[:q]

    @shirts = Shirt.where('name LIKE ?', "#{@query}%")

SELECT "shirts".* FROM "shirts" WHERE "shirts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @shirt = Shirt.find(params[:id])

INSERT INTO "shirts" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 15 Aug 2013 01:02:46 UTC +00:00], ["description", "It's Teal!"], ["name", "Teal Shirt"], ["updated_at", Thu, 15 Aug 2013 01:02:46 UTC +00:00]]
---
  def create
    shirt = Shirt.new(shirt_params)

    if shirt.save

SELECT "shirts".* FROM "shirts" WHERE "shirts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @shirt = Shirt.find(params[:id])

SELECT "shirts".* FROM "shirts" WHERE "shirts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "shirts" SET "name" = ?, "updated_at" = ? WHERE "shirts"."id" = 1  [["name", "Green Shirt"], ["updated_at", Thu, 15 Aug 2013 01:28:27 UTC +00:00]]
---
  def update
    shirt = Shirt.find(params[:id])

    if shirt.update_attributes(shirt_params)

SELECT "shirts".* FROM "shirts" WHERE "shirts"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "shirts" WHERE "shirts"."id" = ?  [["id", 4]]
---
  def destroy
    shirt = Shirt.find(params[:id])

    shirt.destroy